In [1]:
import pandas as pd

In [2]:
#1. Load the file Salaries.csv and get data into DataFrame. Get all the columns
salaries = pd.read_csv('Salaries.csv')
salaries=pd.DataFrame(salaries)
salaries
# salaries.dtypes

C:\Users\MITE\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [8]:
#2. Get the count of number of rows and number of columns.
rows,columns = salaries.shape
print(f'rows : {rows}')
# print(f'columns : {columns}')

rows : 148654

In [10]:
# 3. Get the Average BasePay.
salaries["BasePay"] = pd.to_numeric(salaries["BasePay"],errors='coerce')
salaries["BasePay"] = salaries['BasePay'].fillna(0)

In [13]:
base_pay = sum(salaries['BasePay'])/rows
base_pay

66053.72928809702

In [6]:
base_pay = avg_base_pay['Id']
base_pay

0              1
1              2
2              3
3              4
4              5
           ...
148645    148646
148647    148648
148648    148649
148649    148650
148653    148654
Name: Id, Length: 148650, dtype: int64

In [16]:
#4.What is the highest BasePay?
salaries['BasePay'].max()

319275.01

In [21]:
#5. Display the all unique values of JobTitle.
print(salaries["JobTitle"].unique())
print(len(salaries["JobTitle"].unique()))

['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY'
 'CAPTAIN III (POLICE DEPARTMENT)' 'WIRE ROPE CABLE MAINTENANCE MECHANIC'
 ... 'Conversion' 'Cashier 3' 'Not provided']
2159

In [23]:
#6. Display the EmployeeName, JobTitle, andBasePay of the 5 highest paid employees (based upon BasePay).
salaries.nlargest(5, ['BasePay'])

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
72925,72926,Gregory P Suhr,Chief of Police,319275.01,0,20007.1,86533.2,339282.07,425815.28,2013,NaN,San Francisco,NaN
110532,110533,Amy P Hart,Asst Med Examiner,318835.49,10713,60563.5,89540.2,390111.98,479652.21,2014,NaN,San Francisco,FT
72929,72930,Robert L Shaw,"Dep Dir for Investments, Ret",315572.01,0,0,82849.7,315572.01,398421.67,2013,NaN,San Francisco,NaN
72926,72927,Joanne M Hayes-White,"Chief, Fire Department",313686.01,0,23236,85431.4,336922.01,422353.40,2013,NaN,San Francisco,NaN
72931,72932,Harlan L Kelly-Jr,Executive Contract Employee,313312.52,0,0,82319.5,313312.52,395632.03,2013,NaN,San Francisco,NaN

In [25]:
#7.What is the BasePay of "DAVID SULLIVAN"?
salaries.loc[salaries["EmployeeName"] == "DAVID SULLIVAN"]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.0,8601,189083,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
10120,10121,DAVID SULLIVAN,PLANNER III,94758.0,0,1716.92,NaN,96474.92,96474.92,2011,NaN,San Francisco,NaN

In [26]:
#8. Display the EmployeeName, JobTitle, and BasePayof those people whose JobTitle is "CAPTAIN, FIRE SUPPRESSION".
salaries.loc[salaries["JobTitle"] == "CAPTAIN, FIRE SUPPRESSION"]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
22,23,GEORGE GARCIA,"CAPTAIN, FIRE SUPPRESSION",140546.88,93200.6,39955.2,NaN,273702.71,273702.71,2011,NaN,San Francisco,NaN
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.8,31909.3,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN
26,27,JOHN HANLEY,"CAPTAIN, FIRE SUPPRESSION",92080.80,40008,133696,NaN,265784.56,265784.56,2011,NaN,San Francisco,NaN
52,53,MICHAEL ROLOVICH,"CAPTAIN, FIRE SUPPRESSION",140546.87,77937.2,26203.7,NaN,244687.81,244687.81,2011,NaN,San Francisco,NaN
53,54,DARRYL HUNTER,"CAPTAIN, FIRE SUPPRESSION",140546.88,73207.6,28988.4,NaN,242742.85,242742.85,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3201,3202,GREGORY JONES,"CAPTAIN, FIRE SUPPRESSION",125820.24,0,13095.7,NaN,138915.91,138915.91,2011,NaN,San Francisco,NaN
3283,3284,BRITTON SMITH,"CAPTAIN, FIRE SUPPRESSION",127886.02,0,10137.8,NaN,138023.84,138023.84,2011,NaN,San Francisco,NaN
7223,7224,WILLIAM BARTELS,"CAPTAIN, FIRE SUPPRESSION",65222.55,4564.27,42422,NaN,112208.84,112208.84,2011,NaN,San Francisco,NaN
8684,8685,JEANNE SEYLER,"CAPTAIN, FIRE SUPPRESSION",95055.34,0,9197.14,NaN,104252.48,104252.48,2011,NaN,San Francisco,NaN
34124,34125,JOHN FORBES-3,"CAPTAIN, FIRE SUPPRESSION",0.00,982.06,2277.34,NaN,3259.40,3259.40,2011,NaN,San Francisco,NaN

In [27]:
#9. Display the EmployeeName,JobTitle, and BasePayof those people whose JobTitlecontains the word "CHIEF".
salaries[salaries["JobTitle"].str.contains('CHIEF')]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00,8601,189083,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.9,134426,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.7,40132.2,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.00,0,17115.7,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
31735,31736,BRENT POWELL,CHIEF PREPARATOR,7962.00,0,1699.22,NaN,9661.22,9661.22,2011,NaN,San Francisco,NaN
32623,32624,JAMES BARDEN,"BATTALION CHIEF, (FIRE DEPARTMENT)",0.00,1290.69,5802.68,NaN,7093.37,7093.37,2011,NaN,San Francisco,NaN
33386,33387,NORMAN DALEY,CHIEF SURVEYOR,4787.20,0,0,NaN,4787.20,4787.20,2011,NaN,San Francisco,NaN
34535,34536,SIMON LEE,CHIEF PAYROLL AND PERSONNEL CLERK,0.00,0,2453.17,NaN,2453.17,2453.17,2011,NaN,San Francisco,NaN
35207,35208,PATRICK BOYD,CHIEF ADULT PROBATION OFFICER,1213.24,0,0,NaN,1213.24,1213.24,2011,NaN,San Francisco,NaN

In [29]:
#10.Display the EmployeeName of the person who is getting the lowest salary (based upon TotalPay).
tpaylow = min(salaries['TotalPay'])
tpaylow

-618.13

In [32]:
#11. Get the EmployeeNameof those people who are getting TotalPayof zero (0) or less.
ltz_tpay = salaries.loc[salaries['TotalPay'] <= 0]
ltz_tpay

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
36156,36157,PAULETTE ADAMS,"STATIONARY ENGINEER, WATER TREATMENT PLANT",0.0,0,0,NaN,0.00,0.00,2011,NaN,San Francisco,NaN
36157,36158,KAUKAB MOHSIN,TRANSIT OPERATOR,0.0,0,0,NaN,0.00,0.00,2011,NaN,San Francisco,NaN
36158,36159,JOSEPHINE MCCREARY,MANAGER IV,0.0,0,0,NaN,0.00,0.00,2011,NaN,San Francisco,NaN
70877,70878,Roland Baylon,Deputy Court Clerk II,0.0,0,0,3728.05,0.00,3728.05,2012,NaN,San Francisco,NaN
70927,70928,Felecia Phillips,Registered Nurse,0.0,0,0,3618.13,0.00,3618.13,2012,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.0,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,0.0,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,0.0,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,0.0,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [33]:
#12. Get the Average salary (TotalPay) of the people by year.
avg_tpay = salaries.groupby(['Year']).mean()
avg_tpay

            Id       BasePay      TotalPay  TotalPayBenefits  Notes
Year
2011   18080.0  63595.956517  71744.103871      71744.103871    NaN
2012   54542.5  65436.406857  74113.262265     100553.229232    NaN
2013   91728.5  68509.832156  77611.443142     101440.519714    NaN
2014  129593.0  66557.437750  75463.918140     100250.918884    NaN

In [43]:
#13. Get the count of Employees by JobTitle and display the top 5.
j_title = salaries["JobTitle"].value_counts().head()
print(j_title)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [46]:
#14. Get the Employees whose name starts with "R" and ends with "n".
rn_name = salaries[salaries["EmployeeName"].str.contains('^R.*n$')]
print(rn_name)

            Id     EmployeeName                      JobTitle    BasePay  \
36176    36177   Raymond Guzman   Dep Chf of Dept (Fire Dept)  244102.02
36527    36528      Ruby Martin              Registered Nurse  174044.89
36564    36565  Richard Untalan  Lieutenant, Fire Suppression  128808.89
36567    36568       Ryan Crean  Lieutenant, Fire Suppression  128808.86
36585    36586     Robert Bryan    Assistant Chief Attorney 1  189937.60
...        ...              ...                           ...        ...
148435  148436  Rebecca Woodson    BdComm Mbr, Grp2,M=$25/Mtg     175.00
148520  148521   Robert J Gowan                  Truck Driver       0.00
148610  148611    Ruby S Martin                 Special Nurse      21.22
148625  148626  Renato C Gurion              Registered Nurse       0.00
148644  148645     Randy D Winn  Stationary Eng, Sewage Plant       0.00

       OvertimePay OtherPay Benefits   TotalPay  TotalPayBenefits  Year  \
36176      24204.7  20232.3  64702.7  288538.97         353241.69  2012
36527        949.5    19812  58670.2  194806.37         253476.57  2012
36564      59361.7  19230.5  43300.4  207401.04         250701.45  2012
36567      58917.9  20120.7  42438.3  207847.40         250285.67  2012
36585            0    312.5  58630.1  190250.10         248880.19  2012
...            ...      ...      ...        ...               ...   ...
148435        0.00     0.00    41.59     175.00            216.59  2014
148520        0.00   114.04     0.00     114.04            114.04  2014
148610        0.00     0.00     4.99      21.22             26.21  2014
148625        0.00     6.00     1.24       6.00              7.24  2014
148644        0.00     0.00     0.00       0.00              0.00  2014

        Notes         Agency Status
36176     NaN  San Francisco    NaN
36527     NaN  San Francisco    NaN
36564     NaN  San Francisco    NaN
36567     NaN  San Francisco    NaN
36585     NaN  San Francisco    NaN
...       ...            ...    ...
148435    NaN  San Francisco     PT
148520    NaN  San Francisco     PT
148610    NaN  San Francisco     PT
148625    NaN  San Francisco     PT
148644    NaN  San Francisco     PT

[1259 rows x 13 columns]

In [47]:
#15.Create a pivot table, and experiment with it.
salaries.pivot_table(index=['JobTitle'], values=['TotalPay'], aggfunc='sum')

                                                  TotalPay
JobTitle
ACCOUNT CLERK                                   3654960.14
ACCOUNTANT                                       237146.34
ACCOUNTANT INTERN                               1393523.66
ACPO,JuvP, Juv Prob (SFERS)                       62290.78
ACUPUNCTURIST                                     67594.40
...                                                    ...
X-RAY LABORATORY AIDE                           1370352.89
X-Ray Laboratory Aide                           5082394.27
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS    53632.87
Youth Comm Advisor                               165657.23
ZOO CURATOR                                       66686.56

[2159 rows x 1 columns]